Revit 2027 API
BuiltInFailures.HostedWallAssociationFailures.UnqualifiedWallWarn Property
 Unable to create one or multiple walls as hosted walls on the target host elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnqualifiedWallWarn { get; }
Public Shared ReadOnly Property UnqualifiedWallWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnqualifiedWallWarn {
	FailureDefinitionId^ get ();
}
static member UnqualifiedWallWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.HostedWallAssociationFailures Class
Autodesk.Revit.DB Namespace